{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Events of interest from raw instrumentation logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Time</th>\n",
       "      <th>Action</th>\n",
       "      <th>Path</th>\n",
       "      <th>UID</th>\n",
       "      <th>PID</th>\n",
       "      <th>PPID</th>\n",
       "      <th>Command Line</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1490382765590</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3702</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1490382765592</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3702</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1490382765593</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3702</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>1490382765594</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3702</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>1490382765598</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3702</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>1490382766933</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3709</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>1490382766935</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3709</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>1490382766936</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3709</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>1490382766937</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3709</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>1490382766940</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3709</td>\n",
       "      <td>3701</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv in3.csv ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>1490382767991</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3716</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out3.csv out5.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>1490382767991</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3716</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out3.csv out5.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>1490382768996</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3718</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out4.csv out6.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>1490382768996</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3718</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out4.csv out6.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>1490382770002</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3720</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out5.csv out7.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>1490382770003</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3720</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out5.csv out7.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>1490382771008</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3722</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out6.csv out8.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>1490382771008</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3722</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out6.csv out8.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>1490382772013</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3724</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out7.csv out9.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>1490382772014</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3724</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out7.csv out9.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>1490382773018</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3726</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out8.csv out10.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>1490382773019</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3726</td>\n",
       "      <td>3701</td>\n",
       "      <td>cp out8.csv out10.csv</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Time Action                                               Path  \\\n",
       "1   1490382765590   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "3   1490382765592   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "5   1490382765593   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "7   1490382765594   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "10  1490382765598  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "12  1490382766933   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "14  1490382766935   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "16  1490382766936   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "18  1490382766937   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "21  1490382766940  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "24  1490382767991   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "26  1490382767991  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "29  1490382768996   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "31  1490382768996  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "34  1490382770002   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "36  1490382770003  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "39  1490382771008   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "41  1490382771008  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "44  1490382772013   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "46  1490382772014  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "49  1490382773018   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "51  1490382773019  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "\n",
       "     UID   PID  PPID                                       Command Line  \n",
       "1   1000  3702  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "3   1000  3702  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "5   1000  3702  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "7   1000  3702  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "10  1000  3702  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "12  1000  3709  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "14  1000  3709  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "16  1000  3709  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "18  1000  3709  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "21  1000  3709  3701  python concat_csvs.py in1.csv in2.csv in3.csv ...  \n",
       "24  1000  3716  3701                              cp out3.csv out5.csv   \n",
       "26  1000  3716  3701                              cp out3.csv out5.csv   \n",
       "29  1000  3718  3701                              cp out4.csv out6.csv   \n",
       "31  1000  3718  3701                              cp out4.csv out6.csv   \n",
       "34  1000  3720  3701                              cp out5.csv out7.csv   \n",
       "36  1000  3720  3701                              cp out5.csv out7.csv   \n",
       "39  1000  3722  3701                              cp out6.csv out8.csv   \n",
       "41  1000  3722  3701                              cp out6.csv out8.csv   \n",
       "44  1000  3724  3701                              cp out7.csv out9.csv   \n",
       "46  1000  3724  3701                              cp out7.csv out9.csv   \n",
       "49  1000  3726  3701                             cp out8.csv out10.csv   \n",
       "51  1000  3726  3701                             cp out8.csv out10.csv   "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "logs_df = pd.read_csv('loggedfs_events_pagerank.log')\n",
    "cols = [col for col in logs_df.columns if col in ['Action','Time','Path','PID','PPID','UID','Command Line']]\n",
    "df = logs_df[cols]\n",
    "df[(df['Action'] == 'read') | (df['Action'] == 'write')]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Build a Neo4j lineage graph from instrumentation logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import lineage_graph_fake_telemetry as lg\n",
    "\n",
    "graph = lg.build_lineage_graph('loggedfs_events_pagerank.log')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Custom visualization of lineage graph using Vis.js"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x118ec0278>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Dataset\": \"name\", \"Job\": \"uid\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Query Neo4j temporal lineage graph using Cypher\n",
    "\n",
    "## Query results as a Pandas DataFrame"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# Sanity check query.\n",
    "query = \"\"\"\n",
    "    MATCH (n)-[r]->(m)\n",
    "    RETURN id(n) AS source_id,\n",
    "           id(r) AS rel_id,\n",
    "           id(m) AS target_id\n",
    "\"\"\"\n",
    "\n",
    "results_df = pd.DataFrame(graph.data(query))\n",
    "print(results_df)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Copy detection as a reachability query between 2 content similar datasets"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (n:Dataset)\n",
    "    WHERE (n.name = '/home/lubuntu/src/file_access_monitor/test_workflows/in1.csv'\n",
    "    OR n.name = '/home/lubuntu/src/file_access_monitor/test_workflows/out4.csv')\n",
    "    RETURN id(n) as node_id\n",
    "\"\"\"\n",
    "node_ids = graph.data(query)\n",
    "\n",
    "# Path query with monotonically increasing timestamps.\n",
    "query = \"\"\"\n",
    "    START a=node(%d), b=node(%d)\n",
    "    MATCH p=(a)-[r*]->(b)\n",
    "    WITH head(relationships(p)) as r1, p, b\n",
    "    RETURN p, b.name\n",
    "\"\"\" % (node_ids[0]['node_id'], node_ids[1]['node_id'])\n",
    "\n",
    "\n",
    "paths = graph.data(query)\n",
    "print('\\nFound %d path(s) from a to b:\\n' % len(paths))\n",
    "print(paths)\n",
    "\n",
    "# Path query with monotonically increasing timestamps.\n",
    "query = \"\"\"\n",
    "    START a=node(%d), b=node(%d)\n",
    "    MATCH p=(b)-[r*]->(a)\n",
    "    WITH head(relationships(p)) as r1, p, b\n",
    "    RETURN p, b.name\n",
    "\"\"\" % (node_ids[0]['node_id'], node_ids[1]['node_id'])\n",
    "\n",
    "\n",
    "paths = graph.data(query)\n",
    "print('\\nFound %d path(s) from b to a:\\n' % len(paths))\n",
    "print(paths)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Copy detection as a reachability query between 2 content similar datasets (monotonically increasing edge timestamps)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (n:Dataset)\n",
    "    WHERE (n.name = '/home/lubuntu/src/file_access_monitor/test_workflows/in1.csv'\n",
    "    OR n.name = '/home/lubuntu/src/file_access_monitor/test_workflows/out4.csv')\n",
    "    RETURN id(n) as node_id\n",
    "\"\"\"\n",
    "node_ids = graph.data(query)\n",
    "\n",
    "# Path query with monotonically increasing timestamps.\n",
    "query = \"\"\"\n",
    "    START a=node(%d), b=node(%d)\n",
    "    MATCH p=(a)-[r*]->(b)\n",
    "    WITH head(relationships(p)) as r1, p, b\n",
    "    WHERE all(r2 in relationships(p)\n",
    "              where r2.timestamp>=r1.timestamp)    \n",
    "    RETURN p, b.name\n",
    "\"\"\" % (node_ids[0]['node_id'], node_ids[1]['node_id'])\n",
    "\n",
    "\n",
    "paths = graph.data(query)\n",
    "print('\\nFound %d path(s) from a to b with monotonically increasing timestamps:\\n' % len(paths))\n",
    "print(paths)\n",
    "\n",
    "# Path query with monotonically increasing timestamps.\n",
    "query = \"\"\"\n",
    "    START a=node(%d), b=node(%d)\n",
    "    MATCH p=(b)-[r*]->(a)\n",
    "    WITH head(relationships(p)) as r1, p, b\n",
    "    WHERE all(r2 in relationships(p)\n",
    "              where r2.timestamp>=r1.timestamp)    \n",
    "    RETURN p, b.name\n",
    "\"\"\" % (node_ids[0]['node_id'], node_ids[1]['node_id'])\n",
    "\n",
    "\n",
    "paths = graph.data(query)\n",
    "print('\\nFound %d path(s) from b to a with monotonically increasing timestamps:\\n' % len(paths))\n",
    "print(paths)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "# Aggregate Queries\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    START from=node(*)\n",
    "    MATCH p=(from)-->(to)\n",
    "    WITH from as from, to as to, count(p) as paths\n",
    "    WHERE paths >= 1\n",
    "    RETURN to,paths\n",
    "\"\"\"\n",
    "\n",
    "paths = graph.data(query)\n",
    "print(paths)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "# PageRank"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The cypher extension is already loaded. To reload it, use:\n",
      "  %reload_ext cypher\n",
      "120 rows affected.\n",
      "\n",
      "Original Nodes:\n",
      "[('252', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in4.csv', 'labels': ['Dataset']}), ('250', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in2.csv', 'labels': ['Dataset']}), ('261', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out7.csv', 'labels': ['Dataset']}), ('259', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out6.csv', 'labels': ['Dataset']}), ('266', {'pid': 3726, 'name': 'cp out8.csv out10.csv ', 'labels': ['Job'], 'cpu': 66.99082339617647, 'uid': 'PID=3726,CLI=cp out8.csv out10.csv '}), ('255', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out4.csv', 'labels': ['Dataset']}), ('249', {'pid': 3702, 'name': 'python concat_csvs.py in1.csv in2.csv in3.csv in4.csv out3.csv ', 'labels': ['Job'], 'cpu': 75.23822407795494, 'uid': 'PID=3702,CLI=python concat_csvs.py in1.csv in2.csv in3.csv in4.csv out3.csv '}), ('256', {'pid': 3716, 'name': 'cp out3.csv out5.csv ', 'labels': ['Job'], 'cpu': 73.22634547301756, 'uid': 'PID=3716,CLI=cp out3.csv out5.csv '}), ('260', {'pid': 3720, 'name': 'cp out5.csv out7.csv ', 'labels': ['Job'], 'cpu': 79.27578099482008, 'uid': 'PID=3720,CLI=cp out5.csv out7.csv '}), ('265', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out9.csv', 'labels': ['Dataset']}), ('258', {'pid': 3718, 'name': 'cp out4.csv out6.csv ', 'labels': ['Job'], 'cpu': 99.94386909295231, 'uid': 'PID=3718,CLI=cp out4.csv out6.csv '}), ('262', {'pid': 3722, 'name': 'cp out6.csv out8.csv ', 'labels': ['Job'], 'cpu': 52.75943985446902, 'uid': 'PID=3722,CLI=cp out6.csv out8.csv '}), ('264', {'pid': 3724, 'name': 'cp out7.csv out9.csv ', 'labels': ['Job'], 'cpu': 86.86459674020617, 'uid': 'PID=3724,CLI=cp out7.csv out9.csv '}), ('257', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out5.csv', 'labels': ['Dataset']}), ('251', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in3.csv', 'labels': ['Dataset']}), ('253', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out3.csv', 'labels': ['Dataset']}), ('267', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out10.csv', 'labels': ['Dataset']}), ('248', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in1.csv', 'labels': ['Dataset']}), ('263', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out8.csv', 'labels': ['Dataset']}), ('254', {'pid': 3709, 'name': 'python concat_csvs.py in1.csv in2.csv in3.csv in4.csv out4.csv ', 'labels': ['Job'], 'cpu': 92.62223498356788, 'uid': 'PID=3709,CLI=python concat_csvs.py in1.csv in2.csv in3.csv in4.csv out4.csv '})]\n",
      "node=252, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in4.csv', 'labels': ['Dataset']}\n",
      "node=250, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in2.csv', 'labels': ['Dataset']}\n",
      "node=261, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out7.csv', 'labels': ['Dataset']}\n",
      "node=259, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out6.csv', 'labels': ['Dataset']}\n",
      "node=266, data={'pid': 3726, 'name': 'cp out8.csv out10.csv ', 'labels': ['Job'], 'cpu': 66.99082339617647, 'uid': 'PID=3726,CLI=cp out8.csv out10.csv '}\n",
      "node=255, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out4.csv', 'labels': ['Dataset']}\n",
      "node=249, data={'pid': 3702, 'name': 'python concat_csvs.py in1.csv in2.csv in3.csv in4.csv out3.csv ', 'labels': ['Job'], 'cpu': 75.23822407795494, 'uid': 'PID=3702,CLI=python concat_csvs.py in1.csv in2.csv in3.csv in4.csv out3.csv '}\n",
      "node=256, data={'pid': 3716, 'name': 'cp out3.csv out5.csv ', 'labels': ['Job'], 'cpu': 73.22634547301756, 'uid': 'PID=3716,CLI=cp out3.csv out5.csv '}\n",
      "node=260, data={'pid': 3720, 'name': 'cp out5.csv out7.csv ', 'labels': ['Job'], 'cpu': 79.27578099482008, 'uid': 'PID=3720,CLI=cp out5.csv out7.csv '}\n",
      "node=265, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out9.csv', 'labels': ['Dataset']}\n",
      "node=258, data={'pid': 3718, 'name': 'cp out4.csv out6.csv ', 'labels': ['Job'], 'cpu': 99.94386909295231, 'uid': 'PID=3718,CLI=cp out4.csv out6.csv '}\n",
      "node=262, data={'pid': 3722, 'name': 'cp out6.csv out8.csv ', 'labels': ['Job'], 'cpu': 52.75943985446902, 'uid': 'PID=3722,CLI=cp out6.csv out8.csv '}\n",
      "node=264, data={'pid': 3724, 'name': 'cp out7.csv out9.csv ', 'labels': ['Job'], 'cpu': 86.86459674020617, 'uid': 'PID=3724,CLI=cp out7.csv out9.csv '}\n",
      "node=257, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out5.csv', 'labels': ['Dataset']}\n",
      "node=251, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in3.csv', 'labels': ['Dataset']}\n",
      "node=253, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out3.csv', 'labels': ['Dataset']}\n",
      "node=267, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out10.csv', 'labels': ['Dataset']}\n",
      "node=248, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in1.csv', 'labels': ['Dataset']}\n",
      "node=263, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out8.csv', 'labels': ['Dataset']}\n",
      "node=254, data={'pid': 3709, 'name': 'python concat_csvs.py in1.csv in2.csv in3.csv in4.csv out4.csv ', 'labels': ['Job'], 'cpu': 92.62223498356788, 'uid': 'PID=3709,CLI=python concat_csvs.py in1.csv in2.csv in3.csv in4.csv out4.csv '}\n",
      "\n",
      "Personalize Vector:\n",
      "{'252': 1, '250': 1, '259': 1, '262': 52.75943985446902, '255': 1, '249': 75.23822407795494, '256': 73.22634547301756, '260': 79.27578099482008, '267': 1, '258': 99.94386909295231, '266': 66.99082339617647, '264': 86.86459674020617, '257': 1, '263': 1, '261': 1, '253': 1, '254': 92.62223498356788, '265': 1, '251': 1, '248': 1}\n",
      "\n",
      "Personalized PageRank:\n",
      "[('254', 0.09103626327957555), ('249', 0.08525605770003002), ('264', 0.0708406074819776), ('260', 0.06511488547533649), ('258', 0.06237677396911478), ('261', 0.05801656080856005), ('266', 0.055943616676013275), ('256', 0.055282926397243665), ('262', 0.05316234710007335), ('257', 0.051404549535219314), ('259', 0.049339605943777703), ('263', 0.04660551090653837), ('255', 0.04222177709649569), ('253', 0.038224256929927716), ('265', 0.03034238106680214), ('250', 0.030205179914761817), ('252', 0.030205179914761817), ('251', 0.030205179914761817), ('248', 0.030205179914761817), ('267', 0.024011159974267296)]\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher\n",
    "import networkx as nx\n",
    "import operator\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (a)-[r*]->(b) RETURN p\n",
    "\n",
    "# Networkx graph.\n",
    "g = results.get_graph()\n",
    "\n",
    "#nx.draw(g)\n",
    "#g.nodes(data=True)\n",
    "\n",
    "# Print nodes so that we can see their original ids and properties.\n",
    "print(\"\\nOriginal Nodes:\")\n",
    "print(g.nodes(data=True))\n",
    "\n",
    "# Node weights for personalized pagerank.\n",
    "personalize = {}\n",
    "for node, data in g.nodes(data=True):\n",
    "    if 'Dataset' in data['labels']:\n",
    "        personalize[node] = 1\n",
    "    elif 'Job' in data['labels']:\n",
    "        # Let's weight each edge by the amount of CPU consumed.\n",
    "        personalize[node] = data['cpu']\n",
    "    print(\"node=%s, data=%s\" % (node, data))\n",
    "\n",
    "print(\"\\nPersonalize Vector:\")\n",
    "print(personalize)\n",
    "\n",
    "# Transformation from MultiDigraph to Graph for Pagerank calculation.\n",
    "H = nx.Graph()\n",
    "for src, dst, edge in g.edges(data=True):\n",
    "    # Let's weight each edge by the amount of bytes read / written.\n",
    "    w = edge['data_bytes']\n",
    "    if H.has_edge(src, dst):\n",
    "        H[src][dst]['weight'] += w\n",
    "    else:\n",
    "        H.add_edge(src, dst, weight=w)\n",
    "\n",
    "#print(\"\\nPageRank:\")\n",
    "#print(nx.pagerank(H))\n",
    "\n",
    "print(\"\\nPersonalized PageRank:\")\n",
    "ranks = nx.pagerank(H, personalization=personalize)\n",
    "sorted_ranks = sorted(ranks.items(), key=operator.itemgetter(1), reverse=True)\n",
    "print(sorted_ranks)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [Root]",
   "language": "python",
   "name": "Python [Root]"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
