{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Events of interest from raw instrumentation logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Time</th>\n",
       "      <th>Action</th>\n",
       "      <th>Path</th>\n",
       "      <th>UID</th>\n",
       "      <th>PID</th>\n",
       "      <th>PPID</th>\n",
       "      <th>Command Line</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1490380654673</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3495</td>\n",
       "      <td>3494</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv out2.csv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1490380654675</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3495</td>\n",
       "      <td>3494</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv out2.csv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>1490380654676</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3495</td>\n",
       "      <td>3494</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv out2.csv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1490380654680</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3495</td>\n",
       "      <td>3494</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv out2.csv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>1490380656058</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3502</td>\n",
       "      <td>3494</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv out2.csv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>1490380656061</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3502</td>\n",
       "      <td>3494</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv out2.csv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>1490380656063</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3502</td>\n",
       "      <td>3494</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv out2.csv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>1490380656066</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3502</td>\n",
       "      <td>3494</td>\n",
       "      <td>python concat_csvs.py in1.csv in2.csv out2.csv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>1490380657121</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3509</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out3.csv out5.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>1490380657122</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3509</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out3.csv out5.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>1490380658128</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3511</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out4.csv out6.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>1490380658128</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3511</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out4.csv out6.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>1490380659133</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3513</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out5.csv out7.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>1490380659133</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3513</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out5.csv out7.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>1490380660137</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3515</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out6.csv out8.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>1490380660137</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3515</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out6.csv out8.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>1490380661143</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3517</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out7.csv out9.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>1490380661143</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3517</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out7.csv out9.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>1490380662150</td>\n",
       "      <td>read</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3519</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out8.csv out10.csv</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>1490380662150</td>\n",
       "      <td>write</td>\n",
       "      <td>/home/lubuntu/src/file_access_monitor/test_wor...</td>\n",
       "      <td>1000</td>\n",
       "      <td>3519</td>\n",
       "      <td>3494</td>\n",
       "      <td>cp out8.csv out10.csv</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             Time Action                                               Path  \\\n",
       "1   1490380654673   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "3   1490380654675   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "5   1490380654676   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "8   1490380654680  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "10  1490380656058   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "12  1490380656061   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "14  1490380656063   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "17  1490380656066  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "20  1490380657121   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "22  1490380657122  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "25  1490380658128   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "27  1490380658128  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "30  1490380659133   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "32  1490380659133  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "35  1490380660137   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "37  1490380660137  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "40  1490380661143   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "42  1490380661143  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "45  1490380662150   read  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "47  1490380662150  write  /home/lubuntu/src/file_access_monitor/test_wor...   \n",
       "\n",
       "     UID   PID  PPID                                       Command Line  \n",
       "1   1000  3495  3494  python concat_csvs.py in1.csv in2.csv out2.csv...  \n",
       "3   1000  3495  3494  python concat_csvs.py in1.csv in2.csv out2.csv...  \n",
       "5   1000  3495  3494  python concat_csvs.py in1.csv in2.csv out2.csv...  \n",
       "8   1000  3495  3494  python concat_csvs.py in1.csv in2.csv out2.csv...  \n",
       "10  1000  3502  3494  python concat_csvs.py in1.csv in2.csv out2.csv...  \n",
       "12  1000  3502  3494  python concat_csvs.py in1.csv in2.csv out2.csv...  \n",
       "14  1000  3502  3494  python concat_csvs.py in1.csv in2.csv out2.csv...  \n",
       "17  1000  3502  3494  python concat_csvs.py in1.csv in2.csv out2.csv...  \n",
       "20  1000  3509  3494                              cp out3.csv out5.csv   \n",
       "22  1000  3509  3494                              cp out3.csv out5.csv   \n",
       "25  1000  3511  3494                              cp out4.csv out6.csv   \n",
       "27  1000  3511  3494                              cp out4.csv out6.csv   \n",
       "30  1000  3513  3494                              cp out5.csv out7.csv   \n",
       "32  1000  3513  3494                              cp out5.csv out7.csv   \n",
       "35  1000  3515  3494                              cp out6.csv out8.csv   \n",
       "37  1000  3515  3494                              cp out6.csv out8.csv   \n",
       "40  1000  3517  3494                              cp out7.csv out9.csv   \n",
       "42  1000  3517  3494                              cp out7.csv out9.csv   \n",
       "45  1000  3519  3494                             cp out8.csv out10.csv   \n",
       "47  1000  3519  3494                             cp out8.csv out10.csv   "
      ]
     },
     "execution_count": 1,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "\n",
    "logs_df = pd.read_csv('loggedfs_events_pagerank.log')\n",
    "cols = [col for col in logs_df.columns if col in ['Action','Time','Path','PID','PPID','UID','Command Line']]\n",
    "df = logs_df[cols]\n",
    "df[(df['Action'] == 'read') | (df['Action'] == 'write')]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Build a Neo4j lineage graph from instrumentation logs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import lineage_graph as lg\n",
    "\n",
    "graph = lg.build_lineage_graph('loggedfs_events_pagerank.log')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Custom visualization of lineage graph using Vis.js"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x1135069b0>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Dataset\": \"name\", \"Job\": \"uid\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Query Neo4j temporal lineage graph using Cypher\n",
    "\n",
    "## Query results as a Pandas DataFrame"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false,
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "# Sanity check query.\n",
    "query = \"\"\"\n",
    "    MATCH (n)-[r]->(m)\n",
    "    RETURN id(n) AS source_id,\n",
    "           id(r) AS rel_id,\n",
    "           id(m) AS target_id\n",
    "\"\"\"\n",
    "\n",
    "results_df = pd.DataFrame(graph.data(query))\n",
    "print(results_df)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Copy detection as a reachability query between 2 content similar datasets"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (n:Dataset)\n",
    "    WHERE (n.name = '/home/lubuntu/src/file_access_monitor/test_workflows/in1.csv'\n",
    "    OR n.name = '/home/lubuntu/src/file_access_monitor/test_workflows/out4.csv')\n",
    "    RETURN id(n) as node_id\n",
    "\"\"\"\n",
    "node_ids = graph.data(query)\n",
    "\n",
    "# Path query with monotonically increasing timestamps.\n",
    "query = \"\"\"\n",
    "    START a=node(%d), b=node(%d)\n",
    "    MATCH p=(a)-[r*]->(b)\n",
    "    WITH head(relationships(p)) as r1, p, b\n",
    "    RETURN p, b.name\n",
    "\"\"\" % (node_ids[0]['node_id'], node_ids[1]['node_id'])\n",
    "\n",
    "\n",
    "paths = graph.data(query)\n",
    "print('\\nFound %d path(s) from a to b:\\n' % len(paths))\n",
    "print(paths)\n",
    "\n",
    "# Path query with monotonically increasing timestamps.\n",
    "query = \"\"\"\n",
    "    START a=node(%d), b=node(%d)\n",
    "    MATCH p=(b)-[r*]->(a)\n",
    "    WITH head(relationships(p)) as r1, p, b\n",
    "    RETURN p, b.name\n",
    "\"\"\" % (node_ids[0]['node_id'], node_ids[1]['node_id'])\n",
    "\n",
    "\n",
    "paths = graph.data(query)\n",
    "print('\\nFound %d path(s) from b to a:\\n' % len(paths))\n",
    "print(paths)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Copy detection as a reachability query between 2 content similar datasets (monotonically increasing edge timestamps)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    MATCH (n:Dataset)\n",
    "    WHERE (n.name = '/home/lubuntu/src/file_access_monitor/test_workflows/in1.csv'\n",
    "    OR n.name = '/home/lubuntu/src/file_access_monitor/test_workflows/out4.csv')\n",
    "    RETURN id(n) as node_id\n",
    "\"\"\"\n",
    "node_ids = graph.data(query)\n",
    "\n",
    "# Path query with monotonically increasing timestamps.\n",
    "query = \"\"\"\n",
    "    START a=node(%d), b=node(%d)\n",
    "    MATCH p=(a)-[r*]->(b)\n",
    "    WITH head(relationships(p)) as r1, p, b\n",
    "    WHERE all(r2 in relationships(p)\n",
    "              where r2.timestamp>=r1.timestamp)    \n",
    "    RETURN p, b.name\n",
    "\"\"\" % (node_ids[0]['node_id'], node_ids[1]['node_id'])\n",
    "\n",
    "\n",
    "paths = graph.data(query)\n",
    "print('\\nFound %d path(s) from a to b with monotonically increasing timestamps:\\n' % len(paths))\n",
    "print(paths)\n",
    "\n",
    "# Path query with monotonically increasing timestamps.\n",
    "query = \"\"\"\n",
    "    START a=node(%d), b=node(%d)\n",
    "    MATCH p=(b)-[r*]->(a)\n",
    "    WITH head(relationships(p)) as r1, p, b\n",
    "    WHERE all(r2 in relationships(p)\n",
    "              where r2.timestamp>=r1.timestamp)    \n",
    "    RETURN p, b.name\n",
    "\"\"\" % (node_ids[0]['node_id'], node_ids[1]['node_id'])\n",
    "\n",
    "\n",
    "paths = graph.data(query)\n",
    "print('\\nFound %d path(s) from b to a with monotonically increasing timestamps:\\n' % len(paths))\n",
    "print(paths)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "# Aggregate Queries\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "    START from=node(*)\n",
    "    MATCH p=(from)-->(to)\n",
    "    WITH from as from, to as to, count(p) as paths\n",
    "    WHERE paths >= 1\n",
    "    RETURN to,paths\n",
    "\"\"\"\n",
    "\n",
    "paths = graph.data(query)\n",
    "print(paths)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "# PageRank"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "104 rows affected.\n",
      "\n",
      "Original Nodes:\n",
      "[('222', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out7.csv', 'labels': ['Dataset']}), ('223', {'pid': 3515, 'name': 'cp out6.csv out8.csv ', 'labels': ['Job'], 'cpu': 57.7008108755753, 'uid': 'PID=3515,CLI=cp out6.csv out8.csv '}), ('226', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out9.csv', 'labels': ['Dataset']}), ('224', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out8.csv', 'labels': ['Dataset']}), ('218', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out5.csv', 'labels': ['Dataset']}), ('219', {'pid': 3511, 'name': 'cp out4.csv out6.csv ', 'labels': ['Job'], 'cpu': 96.59249028784154, 'uid': 'PID=3511,CLI=cp out4.csv out6.csv '}), ('216', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out4.csv', 'labels': ['Dataset']}), ('213', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out2.csv', 'labels': ['Dataset']}), ('211', {'pid': 3495, 'name': 'python concat_csvs.py in1.csv in2.csv out2.csv out3.csv ', 'labels': ['Job'], 'cpu': 83.1784507163433, 'uid': 'PID=3495,CLI=python concat_csvs.py in1.csv in2.csv out2.csv out3.csv '}), ('217', {'pid': 3509, 'name': 'cp out3.csv out5.csv ', 'labels': ['Job'], 'cpu': 52.11959918404081, 'uid': 'PID=3509,CLI=cp out3.csv out5.csv '}), ('214', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out3.csv', 'labels': ['Dataset']}), ('228', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out10.csv', 'labels': ['Dataset']}), ('220', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out6.csv', 'labels': ['Dataset']}), ('215', {'pid': 3502, 'name': 'python concat_csvs.py in1.csv in2.csv out2.csv out4.csv ', 'labels': ['Job'], 'cpu': 58.76384547011541, 'uid': 'PID=3502,CLI=python concat_csvs.py in1.csv in2.csv out2.csv out4.csv '}), ('225', {'pid': 3517, 'name': 'cp out7.csv out9.csv ', 'labels': ['Job'], 'cpu': 75.23878761413096, 'uid': 'PID=3517,CLI=cp out7.csv out9.csv '}), ('212', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in2.csv', 'labels': ['Dataset']}), ('227', {'pid': 3519, 'name': 'cp out8.csv out10.csv ', 'labels': ['Job'], 'cpu': 83.5744811420761, 'uid': 'PID=3519,CLI=cp out8.csv out10.csv '}), ('210', {'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in1.csv', 'labels': ['Dataset']}), ('221', {'pid': 3513, 'name': 'cp out5.csv out7.csv ', 'labels': ['Job'], 'cpu': 91.50067820532698, 'uid': 'PID=3513,CLI=cp out5.csv out7.csv '})]\n",
      "node=222, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out7.csv', 'labels': ['Dataset']}\n",
      "node=223, data={'pid': 3515, 'name': 'cp out6.csv out8.csv ', 'labels': ['Job'], 'cpu': 57.7008108755753, 'uid': 'PID=3515,CLI=cp out6.csv out8.csv '}\n",
      "node=226, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out9.csv', 'labels': ['Dataset']}\n",
      "node=224, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out8.csv', 'labels': ['Dataset']}\n",
      "node=218, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out5.csv', 'labels': ['Dataset']}\n",
      "node=219, data={'pid': 3511, 'name': 'cp out4.csv out6.csv ', 'labels': ['Job'], 'cpu': 96.59249028784154, 'uid': 'PID=3511,CLI=cp out4.csv out6.csv '}\n",
      "node=216, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out4.csv', 'labels': ['Dataset']}\n",
      "node=213, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out2.csv', 'labels': ['Dataset']}\n",
      "node=211, data={'pid': 3495, 'name': 'python concat_csvs.py in1.csv in2.csv out2.csv out3.csv ', 'labels': ['Job'], 'cpu': 83.1784507163433, 'uid': 'PID=3495,CLI=python concat_csvs.py in1.csv in2.csv out2.csv out3.csv '}\n",
      "node=217, data={'pid': 3509, 'name': 'cp out3.csv out5.csv ', 'labels': ['Job'], 'cpu': 52.11959918404081, 'uid': 'PID=3509,CLI=cp out3.csv out5.csv '}\n",
      "node=214, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out3.csv', 'labels': ['Dataset']}\n",
      "node=228, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out10.csv', 'labels': ['Dataset']}\n",
      "node=220, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/out6.csv', 'labels': ['Dataset']}\n",
      "node=215, data={'pid': 3502, 'name': 'python concat_csvs.py in1.csv in2.csv out2.csv out4.csv ', 'labels': ['Job'], 'cpu': 58.76384547011541, 'uid': 'PID=3502,CLI=python concat_csvs.py in1.csv in2.csv out2.csv out4.csv '}\n",
      "node=225, data={'pid': 3517, 'name': 'cp out7.csv out9.csv ', 'labels': ['Job'], 'cpu': 75.23878761413096, 'uid': 'PID=3517,CLI=cp out7.csv out9.csv '}\n",
      "node=212, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in2.csv', 'labels': ['Dataset']}\n",
      "node=227, data={'pid': 3519, 'name': 'cp out8.csv out10.csv ', 'labels': ['Job'], 'cpu': 83.5744811420761, 'uid': 'PID=3519,CLI=cp out8.csv out10.csv '}\n",
      "node=210, data={'name': '/home/lubuntu/src/file_access_monitor/test_workflows/in1.csv', 'labels': ['Dataset']}\n",
      "node=221, data={'pid': 3513, 'name': 'cp out5.csv out7.csv ', 'labels': ['Job'], 'cpu': 91.50067820532698, 'uid': 'PID=3513,CLI=cp out5.csv out7.csv '}\n",
      "\n",
      "Personalize Vector:\n",
      "{'225': 75.23878761413096, '223': 57.7008108755753, '224': 0, '218': 0, '219': 96.59249028784154, '216': 0, '213': 0, '214': 0, '217': 52.11959918404081, '222': 0, '228': 0, '220': 0, '221': 91.50067820532698, '215': 58.76384547011541, '226': 0, '212': 0, '227': 83.5744811420761, '211': 83.1784507163433, '210': 0}\n",
      "\n",
      "Personalized PageRank:\n",
      "[('211', 0.0790389934333434), ('215', 0.0751703196983597), ('221', 0.0698413260135405), ('227', 0.06973836645628471), ('225', 0.06868587967394181), ('219', 0.06575255908278504), ('223', 0.06094784568718452), ('222', 0.058873272505008595), ('224', 0.055540849570909684), ('220', 0.05384688137478984), ('218', 0.05151382080763467), ('217', 0.051369523331661615), ('216', 0.04391773984682407), ('214', 0.03862704303187192), ('212', 0.03276868835683505), ('213', 0.03276868835683505), ('210', 0.03276868835683505), ('228', 0.02963841046265477), ('226', 0.02919110395269994)]\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher\n",
    "import networkx as nx\n",
    "import operator\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (a)-[r*]->(b) RETURN p\n",
    "\n",
    "# Networkx graph.\n",
    "g = results.get_graph()\n",
    "\n",
    "#nx.draw(g)\n",
    "#g.nodes(data=True)\n",
    "\n",
    "# Print nodes so that we can see their original ids and properties.\n",
    "print(\"\\nOriginal Nodes:\")\n",
    "print(g.nodes(data=True))\n",
    "\n",
    "# Node weights for personalized pagerank.\n",
    "personalize = {}\n",
    "for node, data in g.nodes(data=True):\n",
    "    if 'Dataset' in data['labels']:\n",
    "        personalize[node] = 0\n",
    "    elif 'Job' in data['labels']:\n",
    "        # Let's weight each edge by the amount of CPU consumed.\n",
    "        personalize[node] = data['cpu']\n",
    "    print(\"node=%s, data=%s\" % (node, data))\n",
    "\n",
    "print(\"\\nPersonalize Vector:\")\n",
    "print(personalize)\n",
    "\n",
    "# Transformation from MultiDigraph to Graph for Pagerank calculation.\n",
    "H = nx.Graph()\n",
    "for src, dst, edge in g.edges(data=True):\n",
    "    # Let's weight each edge by the amount of bytes read / written.\n",
    "    w = edge['data_bytes']\n",
    "    if H.has_edge(src, dst):\n",
    "        H[src][dst]['weight'] += w\n",
    "    else:\n",
    "        H.add_edge(src, dst, weight=w)\n",
    "\n",
    "#print(\"\\nPageRank:\")\n",
    "#print(nx.pagerank(H))\n",
    "\n",
    "print(\"\\nPersonalized PageRank:\")\n",
    "ranks = nx.pagerank(H, personalization=personalize)\n",
    "sorted_ranks = sorted(ranks.items(), key=operator.itemgetter(1), reverse=True)\n",
    "print(sorted_ranks)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [Root]",
   "language": "python",
   "name": "Python [Root]"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
